In [2]:
import pandas as pd

In [4]:
# The data source is from Malaysia DOSM (https://data.gov.my/data-catalogue/births)
URL_DATA = 'https://storage.data.gov.my/demography/births.parquet'

# Extract data from source
df = pd.read_parquet(URL_DATA)

print(df.head())

                   date     state  births
0  -1577923200000000000  Malaysia      96
1  -1577836800000000000  Malaysia     115
2  -1577750400000000000  Malaysia     111
3  -1577664000000000000  Malaysia     101
4  -1577577600000000000  Malaysia      95

In [5]:
# Combine mismatch unique values for different columns and merge them into a single data frame
subset_columns = ['date', 'births']

for col in subset_columns:
    print(f"{col}: {df[col].unique()}")
    print()

date: [-1577923200000000000 -1577836800000000000 -1577750400000000000 ...
 1690588800000000000 1690675200000000000 1690761600000000000]

births: [  96  115  111 ... 1791 1754 1801]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  object
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: int64(1), object(2)
memory usage: 886.8+ KB

In [7]:
# Task 1: Based on the lesson learned previously, convert the "DATE" column data type into datetime format
df['date'] = pd.to_datetime(df['date'])

In [8]:
df.dtypes

date      datetime64[ns]
state             object
births             int64
dtype: object

In [11]:
# Task 2a: Extract the Month name (e.g. January/February/March etc) into another column called "MONTH_NAME"
# Then get average of births aggregate/group by MONTH_NAME
# The expected dataframe is something like this:

# |----------------|-----------|
# |MONTH_NAME      | AVG_BIRTH |
# |----------------|-----------|
# |JANUARY XXX     |           |
# |FEBRUARY XXX    |           |
# |MARCH XXX       |           |
#   .....           

...

Ellipsis

In [25]:
#2a
df['MONTH_NAME'] = df.date.dt.month_name()
df['MONTH_NUMBER'] = df.date.dt.month

In [26]:
df.sample(5)

            date     state  births MONTH_NAME  month_number  MONTH_NUMBER
4906  1933-06-07  Malaysia     335       June             6             6
2860  1927-10-31  Malaysia     257    October            10            10
27373 1994-12-11  Malaysia    1519   December            12            12
12307 1953-09-11  Malaysia     672  September             9             9
27828 1996-03-10  Malaysia    1370      March             3             3

In [27]:
df1 = df\
    .groupby(['MONTH_NAME','MONTH_NUMBER'])\
    .agg(
        AVG_BIRTH=('births', 'mean')
    )\
    .reset_index()\
    
df1

   MONTH_NAME  MONTH_NUMBER   AVG_BIRTH
0       April             4  945.387500
1      August             8  951.493893
2    December            12  951.100846
3    February             2  904.976515
4     January             1  928.116935
5        July             7  946.085608
6        June             6  960.348718
7       March             3  926.428970
8         May             5  959.320099
9    November            11  963.218123
10    October            10  985.878171
11  September             9  981.742071

In [ ]:
# Task 2b: Save the aggregated dataframe in task 2a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_month.csv
# Example: azhar_avg_birth_by_month.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...

In [28]:
df1.to_csv('dr_agg.csv', index=False)

In [16]:
# Task 3a: Create a dataframe to calculate average birth by the following generation group:
# --> Silent Generation - from 1928 to 1945 included
# --> Baby Boomers - from 1946 to 1964 included
# --> Gen X - from 1965 to 1980 included
# --> Gen Y - from 1981 to 1996 included
# The expected dataframe is something like this:

# |----------------|-----------|
# |GENERATION      | AVG_BIRTH |
# |----------------|-----------|
# |Gen X           |           |
# |Gen Y           |           |
# ......

# Hint: Use for-loop and if/else

...

Ellipsis

In [29]:
df['year'] = df.date.dt.year

In [14]:
# Task 3b: Save the aggregated dataframe in task 3a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_generation.csv
# Example: azhar_avg_birth_by_generation.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...

In [30]:
df.head()

        date     state  births MONTH_NAME  month_number  MONTH_NUMBER  year
0 1920-01-01  Malaysia      96    January             1             1  1920
1 1920-01-02  Malaysia     115    January             1             1  1920
2 1920-01-03  Malaysia     111    January             1             1  1920
3 1920-01-04  Malaysia     101    January             1             1  1920
4 1920-01-05  Malaysia      95    January             1             1  1920

In [31]:
df.tail()

,date,state,births,MONTH_NAME,month_number,MONTH_NUMBER,year
37828,2023-07-27,Malaysia,1199,July,7,7,2023
37829,2023-07-28,Malaysia,1220,July,7,7,2023
37830,2023-07-29,Malaysia,927,July,7,7,2023
37831,2023-07-30,Malaysia,938,July,7,7,2023
37832,2023-07-31,Malaysia,1098,July,7,7,2023

In [32]:
for i, x in enumerate(df['year']):
    # Enumerate = generate a row number when we run a for loop.
    # Here it is represented by iâ‰ 
    if x <= 1945:
        df.loc[i, 'generation'] = 'Silent Gen'
    elif x <= 1964:
        df.loc[i, 'generation'] = 'Boomers'
    elif x <= 1980:
        df.loc[i, 'generation'] = 'Gen X'
    elif x <= 1996:
        df.loc[i, 'generation'] = 'Gen Y'
    else:
        df.loc[i, 'generation'] = 'OTHERS'

In [33]:
df2 = df.groupby('generation')['births'].mean().reset_index()

In [34]:
df2.to_csv('generation.csv', index=False)